wikimedia/smash-pig/PaymentProviders/PayPal/Tests/Data/buyer_complaint.json

{
  "mc_gross":"-20.00",
  "invoice":"49020255.1",
  "protection_eligibility":"Ineligible",
  "payer_id":"MYBXFQC36JA56",
  "payment_date":"17:45:02 Aug 29, 2017 PDT",
  "payment_status":"Refunded",
  "charset":"UTF-8",
  "first_name":"Hurgurk",
  "mc_fee":"-0.84",
  "notify_version":"3.8",
  "reason_code":"buyer_complaint",
  "custom":"49020255",
  "business":"blerb@wikimedia.org",
  "verify_sign":"AjStDwheq1BQRze.m1rT996rWsDFAw7YLhmg-SWD0yKsqZg-zQ.xEl4h",
  "payer_email":"hurgurk@blagurk.com",
  "parent_txn_id":"8RW98769SM297882G",
  "txn_id":"1V82215816267470S",
  "payment_type":"instant",
  "last_name":"Blagurk",
  "receiver_email":"blerb@wikimedia.org",
  "payment_fee":"",
  "shipping_discount":"0.00",
  "receiver_id":"EZ782AXEUJUW8",
  "insurance_amount":"0.00",
  "item_name":"Donation to the Wikimedia Foundation",
  "discount":"0.00",
  "mc_currency":"CAD",
  "item_number":"",
  "residence_country":"CA",
  "handling_amount":"0.00",
  "shipping_method":"Default",
  "transaction_subject":"Donation to the Wikimedia Foundation",
  "payment_gross":"",
  "shipping":"0.00",
  "ipn_track_id":"3107ceed29692"
}