wikimedia/smash-pig/PaymentProviders/PayPal/Tests/Data/recurring_payment.json

{
  "business": "nobody@wikimedia.org",
  "receiver_email": "nobody@wikimedia.org",
  "receiver_id": "1234567",
  "payment_status": "Completed",
  "payment_type ": "instant",
  "payment_date": "16:03:13 Sep 21, 2016 PDT",
  "txn_id": "0987654321",
  "initial_payment_txn_id": "123456",
  "mc_gross": "1.50",
  "mc_fee": "0.10",
  "mc_currency": "USD",
  "payment_gross": "1.50",
  "currency_code": "USD",
  "payment_fee ": "0.10",
  "first_name": "Testy",
  "last_name": "McTesterson",
  "address_name": "Testy McTesterson",
  "address_street": "123 Fake St.",
  "address_city": "Fakesville",
  "address_state": "CA",
  "address_zip": "92777",
  "address_country": "United States",
  "payer_email": "blarg@urgrar.com",
  "payer_id": "XXXXXXXXXX",
  "payer_status": "verified",
  "residence_country": "US",
  "address_country_code": "US",
  "address_status": "confirmed",
  "recurring_payment_id": "12345678",
  "rp_invoice_id": "7373.1",
  "product_name": "Donation to the Wikimedia Foundation",
  "product_type": "Donation",
  "period_type": "Regular",
  "payment_cycle": "Monthly",
  "outstanding_balance": "0",
  "amount_per_cycle": "1.50",
  "initial_payment_amount": "0",
  "profile_status": "Active",
  "amount": "1.50",
  "time_created": "10:00:11 Mar 02, 2017 PST",
  "next_payment_date": "03:00:00 Apr 01, 2017 PDT",
  "txn_type": "recurring_payment"
}
