wikimedia/smash-pig/PaymentProviders/PayPal/Tests/Data/recurring_payment_profile_created.json

{
  "payment_cycle": "Monthly",
  "txn_type": "recurring_payment_profile_created",
  "last_name": "Fowl",
  "next_payment_date": "03:00:00 May 18, 2017 PDT",
  "residence_country": "US",
  "initial_payment_amount": "0",
  "rp_invoice_id": "47017286.1",
  "currency_code": "JPY",
  "time_created": "09:45:28 Apr 18, 2017 PDT",
  "verify_sign": "ATZo1sTL1YpCR8SD-CzFolXviWIiAYV78oZbytx6QLNuI3z-KS8wKLqC",
  "period_type": " Regular",
  "payer_status": "unverified",
  "tax": "0",
  "payer_email": "donor@generous.net",
  "first_name": "Fezziwig",
  "receiver_email": "receiver@organization.org",
  "payer_id": "8R297FE87CD8S",
  "product_type": "1",
  "shipping": "0",
  "amount_per_cycle": "140",
  "profile_status": "Active",
  "charset": "UTF-8",
  "notify_version": "3.8",
  "amount": "140",
  "outstanding_balance": "0",
  "recurring_payment_id": "I-88J1M3DLSF0",
  "product_name": "Monthly donation to the Wikimedia Foundation",
  "ipn_track_id": "8999c084zz0f2"
}
