wikimedia/smash-pig/PaymentProviders/PayPal/Tests/Data/recurring_payment_suspended_due_to_max_failed_payment.json

{
  "payment_cycle": "Monthly",
  "txn_type": "recurring_payment_suspended_due_to_max_failed_payment",
  "last_name": "Public",
  "next_payment_date": "N/A",
  "residence_country": "US",
  "initial_payment_amount": "0.00",
  "rp_invoice_id": "49006681.1",
  "currency_code": "USD",
  "time_created": "06:14:38 Aug 02, 2017 PDT",
  "verify_sign": "AjCMMDabnuh7zx7wI4NpWflSS.lHAqA5jlFVAAuXLAx61931ulA3ylnl",
  "period_type": " Regular",
  "payer_status": "verified",
  "tax": "0.00",
  "payer_email": "jonq@public.com",
  "first_name": "John",
  "receiver_email": "nobody@wikimedia.org",
  "payer_id": "WK4ADPUHGWN6U",
  "product_type": "1",
  "shipping": "0.00",
  "amount_per_cycle": "5.00",
  "profile_status": "Suspended",
  "charset": "UTF-8",
  "notify_version": "3.8",
  "amount": "5.00",
  "outstanding_balance": "15.00",
  "recurring_payment_id": "I-WCJA1MBC3CWY",
  "product_name": "Monthly donation to the Wikimedia Foundation",
  "ipn_track_id": "4b8cbe1a39fec"
}
