wikimedia/smash-pig/PaymentProviders/PayPal/Tests/Data/refund_admin_fraud_reversal.json

{
  "transaction_subject": "49123019",
  "payment_date": "21:44:10 Sep 25, 2017 PDT",
  "last_name": "Binks",
  "residence_country": "US",
  "item_name": "Donation to the Wikimedia Foundation",
  "payment_gross": "-2.00",
  "mc_currency": "USD",
  "business": "someone@wikimedia.org",
  "payment_type": "instant",
  "protection_eligibility": "Ineligible",
  "verify_sign": "AxE4TrrxMNhqKiFhwnvr8h7Z1h2CARJqs8-8lTKbgpFWtNqJknF-ZjvM",
  "payer_email": "binks@naboo.gov",
  "txn_id": "41C736991R055474F",
  "receiver_email": "someone@wikimedia.org",
  "first_name": "JarJar",
  "parent_txn_id": "3BR53982VX768520D",
  "payer_id": "N5D6L2B4ZLFJC",
  "receiver_id": "EZ782AXEUJUW8",
  "reason_code": "admin_fraud_reversal",
  "item_number": "DONATE",
  "handling_amount": "0.00",
  "payment_status": "Reversed",
  "payment_fee": "-0.28",
  "mc_fee": "-0.28",
  "shipping": "0.00",
  "mc_gross": "-2.00",
  "custom": "49123019",
  "charset": "UTF-8",
  "notify_version": "3.8",
  "ipn_track_id": "a605cc7b1e5a6"
}