wikimedia/smash-pig/PaymentProviders/PayPal/Tests/Data/refund_ec.json

{
  "mc_gross": "-150",
  "invoice": "46239229.0",
  "protection_eligibility": "Ineligible",
  "payer_id": "RWASDASJ2AS3A",
  "payment_date": "09:34:59 Mar 22, 2017 PDT",
  "payment_status": "Refunded",
  "charset": "UTF-8",
  "first_name": "Testy",
  "mc_fee": "-43",
  "notify_version": "3.8",
  "reason_code": "refund",
  "custom": "46239229.1",
  "business": "gimme@takers.org",
  "verify_sign": "Ar65LQ8D4i5231dnJnwTy8lT8UaGAoJGWSH0c1M93d3B86D4ZGVpax3T",
  "payer_email": "donor@generous.net",
  "parent_txn_id": "1V551844CE5526421",
  "txn_id": "3HD08833MR473623T",
  "payment_type": "instant",
  "last_name": "McTesterson",
  "receiver_email": "gimme@takers.org",
  "payment_fee": "",
  "shipping_discount": "0",
  "receiver_id": "TWDK67ASD2XXY",
  "insurance_amount": "0",
  "item_name": "Donation to the Wikimedia Foundation",
  "discount": "0",
  "mc_currency": "JPY",
  "item_number": "",
  "residence_country": "US",
  "handling_amount": "0",
  "shipping_method": "Default",
  "transaction_subject": "Donation to the Wikimedia Foundation",
  "payment_gross": "",
  "shipping": "0",
  "ipn_track_id": "4e93f423dd88b"
}
