wikimedia/smash-pig/PaymentProviders/PayPal/Tests/Data/subscr_cancel.json

{
    "amount3": "1.03",
    "address_status": "confirmed",
    "subscr_date": "16:03:11 Sep 21, 2016 PDT",
    "payer_id": "2048343366",
    "address_street": "123 Only Joking",
    "mc_amount3": "1.03",
    "charset": "UTF-8",
    "address_zip": "99999",
    "first_name": "Joe",
    "reattempt": "1",
    "address_country_code": "US",
    "address_name": "Joe Camel",
    "notify_version": "3.9",
    "subscr_id": "I-SDAS43366",
    "custom": "7373",
    "payer_status": "verified",
    "business": "nobody@wikimedia.org",
    "address_country": "United States",
    "old_subscr_id": "S-123SADAS456",
    "address_city": "Scranton",
    "verify_sign": "XXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXX",
    "payer_email": "info@google.net",
    "last_name": "Camel",
    "address_state": "CA",
    "receiver_email": "nobody@wikimedia.org",
    "recurring": "1",
    "txn_type": "subscr_cancel",
    "item_name": "Donation to the Wikimedia Foundation",
    "mc_currency": "USD",
    "item_number": "DONATE",
    "residence_country": "US",
    "period3": "1 M",
    "ipn_track_id": "7777777777777"
}
